name: "colbert"
backend: "python"
max_batch_size: 0

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "embedding"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]  # [max_tokens, 128] flattened
  },
  {
    name: "token_lengths"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
