name: "florence2base_model"
backend: "python"
max_batch_size: 0
input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [1, 3, -1, -1]
  },
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [1, 512]
  }
]
output [
  {
    name: "generated_ids"
    data_type: TYPE_INT32
    dims: [1, 512]
  }
]
