name: "align"
backend: "python"
max_batch_size: 0

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  },
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [-1, -1, 3] # -1 means any value greater-or-equal-to 0.
  }
]

output [
  {
    name: "text_embedding"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "image_embedding"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
